doc/s-sql-postgresql-functions.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-12-12 Tue 19:01 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>S-SQL and Postgresql Functions</title>
<meta name="author" content="Sabra Crolleton" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">S-SQL and Postgresql Functions</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgad88663">S-SQL Examples Home Page</a></li>
<li><a href="#postgresql-functions">Postgresql Functions</a>
<ul>
<li><a href="#avg">:avg</a></li>
<li><a href="#generate-series">:generate-series</a></li>
<li><a href="#max">:max</a></li>
<li><a href="#min">:min</a></li>
<li><a href="#random">:random</a></li>
<li><a href="#string-agg">:string_agg</a></li>
<li><a href="#version">:version</a></li>
<li><a href="#combining">Combining Postgresql Functions</a></li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-orgad88663" class="outline-2">
<h2 id="orgad88663"><a href="s-sql-examples.html">S-SQL Examples Home Page</a></h2>
<div class="outline-text-2" id="text-orgad88663">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="s-sql-a.html">A</a></td>
<td class="org-left"><a href="s-sql-b.html">B</a></td>
<td class="org-left"><a href="s-sql-c.html">C</a></td>
<td class="org-left"><a href="s-sql-d.html">D</a></td>
<td class="org-left"><a href="s-sql-e.html">E</a></td>
<td class="org-left"><a href="s-sql-f.html">F</a></td>
<td class="org-left"><a href="s-sql-g.html">G</a></td>
<td class="org-left"><a href="s-sql-h.html">H</a></td>
<td class="org-left"><a href="s-sql-i.html">I</a></td>
<td class="org-left"><a href="s-sql-j.html">J</a></td>
<td class="org-left"><a href="s-sql-k.html">K</a></td>
<td class="org-left"><a href="s-sql-l.html">L</a></td>
<td class="org-left"><a href="s-sql-m.html">M</a></td>
<td class="org-left"><a href="s-sql-n.html">N</a></td>
<td class="org-left"><a href="s-sql-o.html">O</a></td>
<td class="org-left"><a href="s-sql-p.html">P</a></td>
<td class="org-left"><a href="s-sql-r.html">R</a></td>
<td class="org-left"><a href="s-sql-s.html">S</a></td>
<td class="org-left"><a href="s-sql-t.html">T</a></td>
<td class="org-left"><a href="s-sql-u.html">U</a></td>
<td class="org-left"><a href="s-sql-v.html">V</a></td>
<td class="org-left"><a href="s-sql-w.html">W</a></td>
<td class="org-left"><a href="s-sql-special-characters.html">Special Characters</a></td>
<td class="org-left"><a href="calling-postgresql-stored-functions.html">Calling Postgresql Stored Functions and Procedures</a></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-postgresql-functions" class="outline-2">
<h2 id="postgresql-functions">Postgresql Functions</h2>
<div class="outline-text-2" id="text-postgresql-functions">
<p>
Postgresql functions are typically inserted into s-sql in their own form prefaced with : and their parameters are generally single quoted. Here are a few simple examples.
</p>
</div>

<div id="outline-container-avg" class="outline-3">
<h3 id="avg">:avg</h3>
<div class="outline-text-3" id="text-avg">
<div class="org-src-container">
<pre class="src src-lisp">(froundn (query (<span class="org-builtin">:select</span> (<span class="org-builtin">:avg</span> 'latitude) <span class="org-builtin">:from</span> 'countries) <span class="org-builtin">:single</span>) 4)

18.4209
</pre>
</div>
</div>
</div>

<div id="outline-container-generate-series" class="outline-3">
<h3 id="generate-series">:generate-series</h3>
<div class="outline-text-3" id="text-generate-series">
<p>
Generate-series returns a list of of lists of numbers with a starting point of x, and ending point of y and an interval of z (defaulting to 1). Thus:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> '* <span class="org-builtin">:from</span> (<span class="org-builtin">:generate-series</span> 1 10)))

((1) (2) (3) (4) (5) (6) (7) (8) (9) (10))

(query (<span class="org-builtin">:select</span> '* <span class="org-builtin">:from</span> (<span class="org-builtin">:generate-series</span> 1 30 5)))

((1) (6) (11) (16) (21) (26))

(query (<span class="org-builtin">:select</span> '* <span class="org-builtin">:from</span> (<span class="org-builtin">:generate-series</span> 3 30 5)))

((3) (8) (13) (18) (23) (28))

</pre>
</div>
</div>
</div>

<div id="outline-container-max" class="outline-3">
<h3 id="max">:max</h3>
<div class="outline-text-3" id="text-max">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> (<span class="org-builtin">:max</span> 'latitude) <span class="org-builtin">:from</span> 'countries)
       <span class="org-builtin">:single</span>)

72
</pre>
</div>
</div>
</div>

<div id="outline-container-min" class="outline-3">
<h3 id="min">:min</h3>
<div class="outline-text-3" id="text-min">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> (<span class="org-builtin">:min</span> 'latitude) <span class="org-builtin">:from</span> 'countries)
       <span class="org-builtin">:single</span>)

-1029/20

</pre>
</div>
</div>
</div>

<div id="outline-container-random" class="outline-3">
<h3 id="random">:random</h3>
<div class="outline-text-3" id="text-random">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:limit</span>
        (<span class="org-builtin">:order-by</span>
         (<span class="org-builtin">:select</span> 'id 'name <span class="org-builtin">:from</span> 'countries)
         (<span class="org-builtin">:random</span>))
 5))

((54 <span class="org-string">"Israel"</span>) (62 <span class="org-string">"South Africa"</span>) (195 <span class="org-string">"Aruba"</span>) (79 <span class="org-string">"Costa Rica"</span>) (31 <span class="org-string">"OECD"</span>))

</pre>
</div>
</div>
</div>

<div id="outline-container-string-agg" class="outline-3">
<h3 id="string-agg">:string_agg</h3>
<div class="outline-text-3" id="text-string-agg">
<p>
String_agg returns a string containging the values returned, separated by a delimiter. In the following example, we are searching for the name of all the regions in the regions table and we want it all returned as a single string with a delimiting comma.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> (<span class="org-builtin">:string_agg</span> 'name <span class="org-string">","</span>)
        <span class="org-builtin">:from</span> 'regions))

 ((<span class="org-string">"Central America,Middle East,North America,South America,Central Asia,Pacific,Caribbean,Eastern Europe,Western Europe,EMEA,APAC,LATAM,Emerging,US,Canada,Africa,All,Asia,Eastern Africa,Middle Africa,Northern Africa,Southern Africa,Western Africa,Oceania,Northern Europe,Southern Europe,Eastern Asia,South Central Asia,South East Asia"</span>))

</pre>
</div>
</div>
</div>

<div id="outline-container-version" class="outline-3">
<h3 id="version">:version</h3>
<div class="outline-text-3" id="text-version">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> (<span class="org-builtin">:version</span>)))

((<span class="org-string">"PostgreSQL 9.2 on x86_64-pc-linux-gnu, compiled by GCC x86_64"</span>))

</pre>
</div>
<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">table-size</span> (table-name)
  <span class="org-doc">"Return the size of a postgresql table in k or m. Table-name can be either astring or quoted."</span>
  (<span class="org-keyword">when</span> (symbolp table-name)
    (setf table-name  (string-downcase (write-to-string table-name))))
  (query (<span class="org-builtin">:select</span> (<span class="org-builtin">:pg_size_pretty</span> (<span class="org-builtin">:pg_total_relation_size</span> '$1)))
         <span class="org-builtin">:single</span>
         table-name))

(table-size 'countries)

<span class="org-string">"88 kB"</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-combining" class="outline-3">
<h3 id="combining">Combining Postgresql Functions</h3>
<div class="outline-text-3" id="text-combining">
<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">current-database-size-pretty</span> ()
  <span class="org-doc">"Returns the current database size as a string in MB"</span>
  (query (<span class="org-builtin">:select</span> (<span class="org-builtin">:pg_size_pretty</span>
                   (<span class="org-builtin">:pg_database_size</span> (<span class="org-builtin">:current_database</span>))))
         <span class="org-builtin">:single</span>))
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>